from .laba_1 import two_sum
import unittest


class TestMySolution(unittest.TestCase):

  def test_simple(self):
    self.assertEqual(two_sum([3, 3], 6), [0, 1])
    self.assertEqual(two_sum([2,7,11,15], 9), [0, 1])
    self.assertEqual(two_sum([2, "O", 11, 15], 9), 'Ошибка. Пожалуйста, введите числа') #проверка типы вводных данных
    self.assertEqual(two_sum([10, -1, 11, 15], 9), [0, 1]) #проверка отрицательных чисел
    self.assertEqual(two_sum([9, 0, 11, 15], 9), [0, 1]) #проверка нуля
    self.assertEqual(two_sum([2, 7, 11, 15], 12), None) #проверка отсутствия подходящих пар
    self.assertEqual(two_sum([], 9), None) #проверка пустого списка
    self.assertEqual(two_sum([3], 9), None) #проверка маленького списка
    self.assertEqual(two_sum([454, -911, 142, -710, 623, -140, 760, 932, 123, -178, -100, 819, -553, -455, -11, -475, -987, 107, -771, 52, 172, -9, -511, 10, 731, 825, -814, -92, -889, -725, -865, 986, -895, -265, 462, -34, -921, -567, -643, -48, -813, 191, -736, -169, -964, 719, 135, -779, -309, 306, 594, -365, -523, 976, 653, -485, 17, -154, 243, 755, 246, -357, 715, -827, 99, -473, 682, 666, -708, -724, 67, 90, -125, 203, 644, 938, 211, -604, 653, 49, 348, 343, -450, -243, 743, 791, 549, -217, 728, 236, -645, 783, 422, -590, 644, -740, -734, 701, 786, 179], -568), [1, 81])
    #проверка огромного списка
    self.assertEqual(two_sum([1.00, 8.00], 9), [0, 1])  # проверка типа float
    self.assertEqual(two_sum([1, 8.00], 9), [0, 1])  # проверка типа float вместе с типом int




if __name__ == '__main__':
  unittest.main()